{
  "selectedTemplate": 9,
  "headings": {
    "work": "Work Experience",
    "education": "Education",
    "skills": "Technical Skills",
    "projects": "Side Projects"
  },
  "basics": {
    "name": "Himanshu Rastogi",
    "email": "hiremehimanshu@gmail.com",
    "website": "https://github.com/xhimanshuz",
    "location": {
      "address": "India"
    },
    "phone": "(+91) 9058613131"
  },
  "education": [
    {
      "location": "Meerut",
      "area": "( Computer Science )",
      "institution": "Chaudhary Charan Singh",
      "studyType": "Bachelor of Computer Application",
      "startDate": "2015",
      "endDate": "2018"
    }
  ],
  "work": [
    {
      "location": "April 2019",
      "website": "",
      "startDate": "Present",
      "highlights": [
        "High-Frequency Trading Application: Write high frequency and low latency trading application for Borsa Stock Exchange in C/C++ with libraries like Boost, NanoLog, Pistache, OUCH, Novaspark, and SolarTrade on Linux Operating System.",
        "Optimize High-Frequency Trading Application: Optimize trading application to make it send orders in 8 microseconds, lowest latency in Borsa stock exchange on testing Hardware.",
        "Real-Time GUI Application: Write Graphical User Interface application for High-Frequency Trading Application in C/C++ with Boost and Qt5 Library to control and observe real-time orders. Also, send manual order and Start and Stop Strategies from it on Win32 and Linux Operating Systems.",
        "Cleared Borsa Stock Exchange Certification.",
        "Integrate and Optimize FIX Engine 10x faster: Later integrate the FIXEngine library to handle FIX protocol in low latency application. Make it 10x faster in receiving and handling FIX messages.",
        "FXCM Trading Application: Write multi-threaded FXCM trading server application which performs BUY/SELL action by TensorFlow prediction model and back trading in Python 3 with libraries like logging, Pandas, and Flask for the REST API server. • GUI for FXCM Application: Write GUI Client for FXCM server Application in C/C++ with Qt library on Windows System.",
        "GUI for FXCM Application: Write GUI Client for FXCM server Application in C/C++ with Qt library on Windows System.",
        "Auto Login Bot: Write Auto login script on GUI application like trading workstation in Python 3 with the pyautogui module.",
        "Integrate Telegram, Email, and Discord Bot in existing applications.",
        "Developed Scraping bot in Python 3 with the help of selenium to scrape reviews for data procession and machine learning model training.",
        "Licence Checker: Write a script to check project source code and license on Github in Python 3 with the request library and GitHub API."
      ],
      "company": "HFTSolution",
      "position": "C/C++ Developer",
      "endDate": "Mar 2019"
    },
    {
      "highlights": [
        "Build libCurl static Library with all its dependencies like zlib, openSSL from scratch in Visual Studio 2013 and integrate to company's existing application in C on Windows System. ",
        "Added existing application dynamic setting feature in C/C++ with Qt library, which  reflects according to XML file and visa-versa.",
        "Wrote and maintained Qt/C++ based custom translation application which bypasses validator of Qt translation file. With auto-export to RCC resource file support and auto translation from Yendex api support."
      ],
      "company": "Pthinks",
      "position": "Qt/C++ Trainee",
      "location": "Bengaluru",
      "startDate": "Dec 2018",
      "endDate": "Mar 2019"
    }
  ],
  "skills": [
    {
      "level": "",
      "keywords": [
        "GNU/Linux",
        "Windows"
      ],
      "name": "OS"
    },
    {
      "keywords": [
        "C, C++11/14/17 (STL, Qt, Boost, Beast, Asio, QuickFIX)",
        "Python (PyQt, selenium, Flask)",
        "Shell"
      ],
      "name": "Languages"
    },
    {
      "keywords": [
        "SQLite",
        "MySQL",
        "MSSQL",
        "MongoDB",
        "PostgreSQL"
      ],
      "name": "Database"
    },
    {
      "keywords": [
        "GNU Make",
        "QMake",
        "CMake"
      ],
      "name": "Build Tools"
    },
    {
      "keywords": [
        "Git",
        "Docker",
        "GDB"
      ],
      "name": "Other Tools"
    }
  ],
  "projects": [
    {
      "description": "A todo list, task tracking, and note-making Graphical application with auto-saving and multiple tab managing features for Cross-Platform systems.",
      "url": "https://github.com/xhimanshuz/qPadNote",
      "keywords": [
        "C/C++",
        "Qt",
        "SQLite",
        "Asio"
      ],
      "name": "qPadNote"
    },
    {
      "keywords": [
        "C++",
        "Boost",
        "Asio",
        "MongoDB"
      ],
      "url": "https://github.com/xhimanshuz/qPadNote-CloudServer/",
      "description": "Server Application to send, receive, and store qPadNote Data on Server over the network using Socket Programming with Boost.Asio, So The client can use it from anywhere.",
      "name": "qPadNote Cloud Server"
    },
    {
      "keywords": [
        "C/C++",
        "libCurl",
        "Qt"
      ],
      "name": " CurlUD",
      "url": "https://github.com/xhimanshuz/curlud",
      "description": "CurlUD is a C++ based application with Qt library for GUI which helps you to upload and download files to/from the server with the help of the curl library."
    },
    {
      "keywords": [
        "Python 3",
        "Gtk+",
        "JSON"
      ],
      "name": " FlashyPi",
      "description": "A tool to flash Raspberry Pi OSs on SD Cards and flash drives. It can either flash the chosen OS or only format the drive for installing bootloaders like Berryboot, NOOBS, PINNS. and also set the partition size according to your requirement.",
      "url": "https://github.com/xhimanshuz/FlashyPi"
    },
    {
      "keywords": [
        "Python 3"
      ],
      "name": "ngxManager - Multiple host manager",
      "description": "It is a Python-based script to host Nginx Multiple websites on a single system.",
      "url": "https://github.com/xhimanshuz/ngxManager"
    },
    {
      "keywords": [
        "C++",
        "SFML Library"
      ],
      "name": "SFML - Distance-between-2-objects",
      "description": "A simple program that shows the distance between two objects, if they are colliding then object 2 color change randomly. It is written in C++ with SFML Library.",
      "url": "https://github.com/xhimanshuz/SFML-Distance-between-2-objects"
    },
    {
      "keywords": [
        "Python 3",
        "Gtk+",
        "Nginx"
      ],
      "url": "https://github.com/xhimanshuz/GEMP",
      "description": "A web server services configuration application developed in python3 with Gtk+. It controls and configures all stack services for you.",
      "name": "GEMP"
    },
    {
      "keywords": [
        "C++17",
        "Asio",
        "Beast"
      ],
      "name": "Chutter-putter - Rendezvous Server",
      "description": " Rendezvous Server to help clients locate each and established peer-to-peer connection with TCP NAT Hole-Punching technique mentioned in Bryan Ford's Paper's \"Peer-to-Peer Communication Across Network Address Translators\" ",
      "url": "https://github.com/xhimanshuz/chutter-putter"
    },
    {
      "keywords": [
        "C++",
        "Qt",
        "Asio",
        "Boost.Json"
      ],
      "name": "Chutter-putter - P2P Client",
      "description": "Chutter-putter is a P2P client, It is used to perform TCP Hole punching technique to make the client connect to each other directly and Peer-to-peer connection.",
      "url": "https://github.com/xhimanshuz/chutter-putter-client"
    }
  ],
  "awards": [
    {
      "date": "",
      "awarder": "",
      "summary": ""
    }
  ],
  "sections": [
    "templates",
    "profile",
    "work",
    "skills",
    "projects",
    "education",
    "awards"
  ]
}