{
  "selectedTemplate": 9,
  "headings": {
    "work": "Work Experiance",
    "education": "Education",
    "skills": "Technical Skills",
    "projects": "Side Projects"
  },
  "basics": {
    "name": "Himanshu Rastogi",
    "email": "hireme@xhimanshuz.xyz",
    "website": "https://github.com/xhimanshuz",
    "location": {
      "address": "India"
    },
    "phone": "(+91) 9058613131"
  },
  "education": [
    {
      "location": "Noida",
      "area": "( Computer Science )",
      "institution": "Chaudhary Charan Singh",
      "studyType": "Bachelor of Computer Application",
      "startDate": "2015",
      "endDate": "2018"
    }
  ],
  "work": [
    {
      "location": "April 2019",
      "website": "",
      "startDate": "Present",
      "highlights": [
        "High Frequency Trading Application: Write high frequency and low latency trading application for Borsa Stock Exchange in C/C++ with  libraries like Boost, NanoLog, Pistache, OUCH, Novaspark and SolarTrade  on Linux Operating System.",
        "Optimize High Frequency Trading Application:  Optimize trading application to make it send orders in 8 microseconds, lowest latency in Borsa stock exchange on testhing Hardware.",
        "Real Time GUI Application: Write Graphical User Interface application for High Frequency Trading Application in C/C++ with Boost and Qt5 Library to control and observe real time orders. Also send manual order and Start and Stop Strategies from it on Win32 and Linux Operating Systems..",
        "Cleared Borsa Stock Exchange Certification..",
        "Integrate FIX Engine: Later integrate FIXEngine library to handle FIX protocol in  low latency application.",
        "Optimize OuickFix Engine: Make existing QuickFix Engine 10x Faster for receiving  market data more quickly with valid data.",
        "FXCM Trading Application: Write multi threaded FXCM trading server application which perform BUY/SELL action by tensorflow prediction model and backtrading in Python 3 with libaries like logging, Pandas and Flask for REST API server.",
        "GUI for FXCM Application: Write GUI Client for FXCM server Application in C/C++ with Qt library on Windows System.",
        "Auto Login Bot: Write Auto login script on GUI application like trading workstation in Python 3 with pyautogui module.",
        "Integrate Telegram, Email and Discord Bot in existing application.",
        "Developed Scraping bot in Python 3 with the help of selenium to scrape reviews for data procession and machine learning model training.",
        "Licence Checker: Write script to check project source code and license on Github in Python 3 with request library and github api. "
      ],
      "company": "HFTSolution",
      "position": "C/C++ Developer",
      "endDate": "Mar 2019"
    },
    {
      "highlights": [
        "Build libCurl static Library with all its dependencies like zlib, openSSL from scratch in Visual Studio 2013 and integrate to company's existing application in C on Windows System. ",
        "Added existing application dynamic setting feature in C/C++ with Qt library, which  reflects according to XML file and visa-versa.",
        "Wrote and maintained Qt/C++ based custom translation application which bypasses validator of Qt translation file. With auto-export to RCC resource file support and auto translation from Yendex api support."
      ],
      "company": "Pthinks",
      "position": "Qt/C++ Trainee",
      "location": "Bengaluru",
      "startDate": "Dec 2018",
      "endDate": "Mar 2019"
    }
  ],
  "skills": [
    {
      "level": "",
      "keywords": [
        "GNU/Linux",
        "Unix",
        "Windows",
        "MacOS"
      ],
      "name": "Operating System"
    },
    {
      "keywords": [
        "C/C++11/14 (STL, Qt, Boost, Asio, OUCH, QuickFIX)",
        "Python (PyQt, selenium, Flask)",
        "Shell"
      ],
      "name": "Programming Languages"
    },
    {
      "keywords": [
        "Nginx"
      ],
      "name": "Server Software"
    },
    {
      "keywords": [
        "Wordpress"
      ],
      "name": "Web Technologies"
    },
    {
      "keywords": [
        "GNU Make",
        "QMake",
        "CMake"
      ],
      "name": "Build System"
    },
    {
      "keywords": [
        "SQLite",
        "MySQL",
        "MSSQL",
        "MongoDB"
      ],
      "name": "Database"
    },
    {
      "keywords": [
        "Qt Creator",
        "Visual Studio Code",
        "Visual Studio",
        "Git",
        "Emacs",
        "Vim",
        "Docker",
        "GDB"
      ],
      "name": "Other Tools"
    },
    {
      "keywords": [
        ""
      ],
      "name": " ."
    },
    {
      "keywords": [
        ""
      ]
    }
  ],
  "projects": [
    {
      "description": "A todo list, task tracking and note making Graphical application with auto-saving and multiple tab managing features for Cross-Platform systems.",
      "url": "https://github.com/xhimanshuz/qPadNote",
      "keywords": [
        "C/C++",
        "Qt",
        "SQLite",
        "Asio"
      ],
      "name": "qPadNote"
    },
    {
      "keywords": [
        "C++",
        "Boost",
        "Asio",
        "MongoDB"
      ],
      "url": "https://github.com/xhimanshuz/qPadNote-CloudServer/",
      "description": "Server Application to send, receive and store qPadNote Data on Server over network using Socket Programming with Boost.Asio, So Client can use it from anywhere.",
      "name": "qPadNote Cloud Server"
    },
    {
      "keywords": [
        "C/C++",
        "libCurl",
        "Qt"
      ],
      "name": " CurlUD",
      "url": "https://github.com/xhimanshuz/curlud",
      "description": "CurlUD is a C++ based application with Qt library for GUI which helps you to upload and download files to/from server with the help of curl library."
    },
    {
      "keywords": [
        "Python 3",
        "Gtk+",
        "JSON"
      ],
      "name": " FlashyPi",
      "description": " A tool to flash Raspberry Pi OSs on SD Cards and flashdrives. It can either flash the chosen OS or only format the drive for installing bootloaders like Berryboot, NOOBS, PINNS. and also set the partition size according to your requirement.",
      "url": "https://github.com/xhimanshuz/FlashyPi"
    },
    {
      "keywords": [
        "Python 3"
      ],
      "name": "ngxManager - Multiple host manager",
      "description": "It is Python based script to host Nginx Multiple website on a single system.",
      "url": "https://github.com/xhimanshuz/ngxManager"
    },
    {
      "keywords": [
        "C++",
        "SFML Library"
      ],
      "name": "SFML - Distance-between-2-objects",
      "description": "Simple program which shows distance between two objects, if they are colliding then object 2 color change randomly. It is written in C++ with SFML Library. ",
      "url": "https://github.com/xhimanshuz/SFML-Distance-between-2-objects"
    },
    {
      "keywords": [
        "Python 3",
        "Gtk+",
        "Nginx"
      ],
      "url": "https://github.com/xhimanshuz/GEMP",
      "description": "A web server services configuration application developed in python3 with Gtk+. It controls and configure all stack services for you.",
      "name": "GEMP"
    }
  ],
  "awards": [
    {
      "date": "",
      "awarder": "",
      "summary": ""
    }
  ],
  "sections": [
    "templates",
    "profile",
    "work",
    "skills",
    "projects",
    "awards",
    "education"
  ]
}